{"source_id":"bs_program_overview","chunk_id":"program_type","content":"The University of Arizona offers a Bachelor of Science (BS) in Software Engineering program. This is an undergraduate degree program available to on-campus, distance, and online students.","metadata":{"topic":"program_information","degree_level":"undergraduate","program":"BS Software Engineering"}}
{"source_id":"ms_program_overview","chunk_id":"program_type","content":"The University of Arizona offers a Master of Science (MS) in Software Engineering program. This graduate program includes both thesis and non-thesis options, with various specialization tracks available.","metadata":{"topic":"program_information","degree_level":"graduate","program":"MS Software Engineering"}}
{"source_id":"phd_program_overview","chunk_id":"program_type","content":"The University of Arizona offers a Doctor of Philosophy (PhD) in Software Engineering program. This advanced research-focused degree includes qualifying exam requirements, dissertation requirements, and various funding opportunities.","metadata":{"topic":"program_information","degree_level":"doctoral","program":"PhD Software Engineering"}}
{"source_id":"bs_curriculum","chunk_id":"required_coursework","content":"The BS Software Engineering program has specific required degree coursework that varies by semester. Course planning guides are available for typical 4-year degree completion for on-campus, distance, and online students.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"coursework","planning_years":4}}
{"source_id":"bs_curriculum","chunk_id":"course_prerequisites","content":"All BS Software Engineering courses have specific prerequisites that must be completed before enrollment. Detailed prerequisite information is available for each course in the program.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"prerequisites"}}
{"source_id":"bs_curriculum","chunk_id":"technical_electives","content":"The BS Software Engineering program includes pre-approved undergraduate technical electives that students can choose from to fulfill degree requirements.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"technical_electives"}}
{"source_id":"bs_curriculum","chunk_id":"course_details","content":"Detailed course descriptions are available for all BS Software Engineering courses, including information on prerequisites, co-requisites, campus location (main campus, distance, or online), and the typical semester when courses are offered.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"course_details"}}
{"source_id":"bs_admissions","chunk_id":"major_requirements","content":"The BS Software Engineering program has specific major admission requirements that prospective students must meet for acceptance into the program.","metadata":{"topic":"admissions","degree_level":"undergraduate","section":"requirements"}}
{"source_id":"bs_admissions","chunk_id":"transfer_credit","content":"Transfer credit applicability and the transfer credit process are available for students who have completed coursework at other institutions. The chatbot can provide information on how transfer credits are evaluated and applied to the BS Software Engineering degree.","metadata":{"topic":"admissions","degree_level":"undergraduate","section":"transfer_credit"}}
{"source_id":"bs_registration","chunk_id":"course_registration","content":"Information on the course registration process and credit requirements is available to help BS Software Engineering students enroll in their required and elective courses each semester.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"registration"}}
{"source_id":"ms_curriculum","chunk_id":"required_coursework","content":"The MS Software Engineering program has specific required coursework that students must complete. Detailed information about course requirements is available.","metadata":{"topic":"curriculum","degree_level":"graduate","section":"coursework"}}
{"source_id":"ms_curriculum","chunk_id":"course_prerequisites","content":"MS Software Engineering courses have specific prerequisites that must be met before enrollment. Prerequisite information is available for all graduate courses.","metadata":{"topic":"curriculum","degree_level":"graduate","section":"prerequisites"}}
{"source_id":"ms_curriculum","chunk_id":"technical_electives","content":"The MS Software Engineering program offers possible technical electives that students can select to customize their graduate education and align with their career goals.","metadata":{"topic":"curriculum","degree_level":"graduate","section":"technical_electives"}}
{"source_id":"ms_program_options","chunk_id":"specialization_tracks","content":"The MS Software Engineering program offers various specialization tracks that allow students to focus their studies in specific areas of software engineering.","metadata":{"topic":"program_information","degree_level":"graduate","section":"specializations"}}
{"source_id":"ms_program_options","chunk_id":"thesis_options","content":"MS Software Engineering students can choose between thesis and non-thesis options. The thesis option involves conducting original research and writing a thesis, while the non-thesis option typically requires additional coursework or a comprehensive exam.","metadata":{"topic":"program_information","degree_level":"graduate","section":"degree_options"}}
{"source_id":"ms_admissions","chunk_id":"admission_requirements","content":"The MS Software Engineering program has specific admission requirements that applicants must meet, including academic credentials, test scores, and other eligibility criteria.","metadata":{"topic":"admissions","degree_level":"graduate","section":"requirements"}}
{"source_id":"phd_curriculum","chunk_id":"required_coursework","content":"The PhD Software Engineering program has specific required coursework that doctoral students must complete as part of their degree requirements.","metadata":{"topic":"curriculum","degree_level":"doctoral","section":"coursework"}}
{"source_id":"phd_curriculum","chunk_id":"course_prerequisites","content":"PhD Software Engineering courses have specific prerequisites that students must satisfy before enrollment. Prerequisite information is available for all doctoral-level courses.","metadata":{"topic":"curriculum","degree_level":"doctoral","section":"prerequisites"}}
{"source_id":"phd_curriculum","chunk_id":"technical_electives","content":"The PhD Software Engineering program offers possible technical electives that allow doctoral students to deepen their expertise in specialized areas relevant to their research.","metadata":{"topic":"curriculum","degree_level":"doctoral","section":"technical_electives"}}
{"source_id":"phd_curriculum","chunk_id":"minor_options","content":"PhD Software Engineering students have the option to pursue minors in complementary fields to broaden their academic background and research capabilities.","metadata":{"topic":"curriculum","degree_level":"doctoral","section":"minor_options"}}
{"source_id":"phd_program","chunk_id":"research_guidance","content":"The PhD Software Engineering program provides guidance on research focus areas and faculty advisors. Students can learn about different research opportunities and connect with faculty members whose research interests align with their own.","metadata":{"topic":"program_information","degree_level":"doctoral","section":"research"}}
{"source_id":"phd_program","chunk_id":"qualifying_exams","content":"PhD Software Engineering students must pass qualifying exam requirements as part of their doctoral studies. These exams assess students' readiness to conduct independent research.","metadata":{"topic":"program_information","degree_level":"doctoral","section":"qualifying_exams"}}
{"source_id":"phd_program","chunk_id":"dissertation","content":"The PhD Software Engineering program requires students to complete dissertation requirements, including conducting original research and defending their dissertation before a committee.","metadata":{"topic":"program_information","degree_level":"doctoral","section":"dissertation"}}
{"source_id":"phd_program","chunk_id":"funding","content":"Various funding opportunities are available for PhD Software Engineering students, including research assistantships, teaching assistantships, fellowships, and other financial support options.","metadata":{"topic":"financial_aid","degree_level":"doctoral","section":"funding"}}
{"source_id":"phd_admissions","chunk_id":"admission_requirements","content":"The PhD Software Engineering program has specific admission requirements that applicants must meet, including strong academic credentials, research experience, and alignment with faculty research interests.","metadata":{"topic":"admissions","degree_level":"doctoral","section":"requirements"}}
{"source_id":"academic_advising","chunk_id":"undergraduate_advisor","content":"Contact and scheduling information is available for BS Software Engineering academic advisors who can assist undergraduate students with course planning, degree requirements, and academic guidance.","metadata":{"topic":"advising","degree_level":"undergraduate","contact_type":"academic_advisor"}}
{"source_id":"academic_advising","chunk_id":"graduate_advisor","content":"Contact and scheduling information is available for MS and PhD Software Engineering academic advisors who can assist graduate students with program requirements, research guidance, and academic planning.","metadata":{"topic":"advising","degree_level":"graduate","contact_type":"academic_advisor"}}
{"source_id":"admissions_process","chunk_id":"general_guidance","content":"Step-by-step general guidance is available for the application process for BS, MS, and PhD Software Engineering programs. This includes information on how to prepare and submit applications for each degree level.","metadata":{"topic":"admissions","section":"application_process"}}
{"source_id":"admissions_process","chunk_id":"deadlines_documents","content":"Information on application deadlines, required documents, and eligibility criteria is available for all Software Engineering programs (BS, MS, and PhD) at the University of Arizona.","metadata":{"topic":"admissions","section":"requirements_deadlines"}}
{"source_id":"admissions_process","chunk_id":"international_students","content":"Details about international student admissions are available, including specific requirements, visa information, and additional documentation needed for international applicants to Software Engineering programs.","metadata":{"topic":"admissions","section":"international","student_type":"international"}}
{"source_id":"admissions_process","chunk_id":"transfer_process","content":"Information about the transfer credit process is available for students who have completed coursework at other institutions and wish to apply those credits toward a University of Arizona Software Engineering degree.","metadata":{"topic":"admissions","section":"transfer_credit"}}
{"source_id":"admissions_process","chunk_id":"dual_degree","content":"Information about dual-degree options is available for students interested in pursuing multiple degrees simultaneously or in combination with Software Engineering programs.","metadata":{"topic":"admissions","section":"dual_degree"}}
{"source_id":"careers","chunk_id":"social_media","content":"Software Engineering graduates can pursue careers in social media platforms, developing applications, features, and infrastructure for social networking services. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"social_media_platforms"}}
{"source_id":"careers","chunk_id":"cloud_computing","content":"Software Engineering graduates can pursue careers in cloud computing, working on distributed systems, cloud infrastructure, and scalable applications. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"cloud_computing"}}
{"source_id":"careers","chunk_id":"embedded_systems","content":"Software Engineering graduates can pursue careers in embedded systems, developing software for hardware devices, IoT applications, and real-time systems. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"embedded_systems"}}
{"source_id":"careers","chunk_id":"artificial_intelligence","content":"Software Engineering graduates can pursue careers in artificial intelligence, working on machine learning models, AI systems, and intelligent applications. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"artificial_intelligence"}}
{"source_id":"careers","chunk_id":"automation","content":"Software Engineering graduates can pursue careers in automation, developing systems that automate industrial processes, business workflows, and repetitive tasks. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"automation"}}
{"source_id":"careers","chunk_id":"avionics","content":"Software Engineering graduates can pursue careers in avionics, working on aircraft systems, flight control software, and aerospace applications. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"avionics"}}
{"source_id":"careers","chunk_id":"vehicle_automation","content":"Software Engineering graduates can pursue careers in vehicle automation, developing autonomous driving systems, driver assistance features, and vehicle software platforms. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"vehicle_automation"}}
{"source_id":"careers","chunk_id":"cybersecurity","content":"Software Engineering graduates can pursue careers in cybersecurity, protecting systems from threats, developing security protocols, and ensuring data privacy. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"cybersecurity"}}
{"source_id":"careers","chunk_id":"machine_learning","content":"Software Engineering graduates can pursue careers in machine learning, building predictive models, training neural networks, and implementing ML algorithms. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"machine_learning"}}
{"source_id":"careers","chunk_id":"medical_applications","content":"Software Engineering graduates can pursue careers in medical applications, developing healthcare software, medical devices, and health informatics systems. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"medical_applications"}}
{"source_id":"careers","chunk_id":"full_stack","content":"Software Engineering graduates can pursue careers in full stack development, working on both frontend and backend systems, web applications, and complete software solutions. Typical salary ranges vary based on experience and location.","metadata":{"topic":"career_opportunities","field":"full_stack_development"}}
{"source_id":"research_centers","chunk_id":"ece_research","content":"Information about research centers within the field of Electrical and Computer Engineering at the University of Arizona is available. These centers provide opportunities for cutting-edge research and collaboration.","metadata":{"topic":"research","department":"ECE","resource_type":"research_centers"}}
{"source_id":"research_centers","chunk_id":"faculty_research","content":"A list of ECE faculty conducting research and their focus areas is available. Students can learn about faculty research interests to identify potential advisors and research opportunities.","metadata":{"topic":"research","department":"ECE","resource_type":"faculty_list"}}
{"source_id":"university_resources","chunk_id":"career_services","content":"The University of Arizona's Student Engagement and Career Development office provides career services to all students and alumni, including career counseling, job search assistance, resume reviews, and networking opportunities.","metadata":{"topic":"career_services","resource_type":"university_service"}}
{"source_id":"financial_aid","chunk_id":"scholarships_overview","content":"The University of Arizona offers various scholarship and financial aid options to help students fund their education. Information about eligibility, application processes, and award amounts is available through the University of Arizona Scholarships and Financial Aid office.","metadata":{"topic":"financial_aid","section":"scholarships_overview"}}
{"source_id":"university_links","chunk_id":"sfwe_website","content":"The official Software Engineering website provides comprehensive information about programs, faculty, research, and student resources. Visit the website for the most up-to-date program information.","metadata":{"topic":"university_resources","resource_type":"official_website","link_name":"Software Engineering website"}}
{"source_id":"university_links","chunk_id":"sie_department","content":"The Systems and Industrial Engineering Department website provides information about the department housing the Software Engineering programs, including faculty, facilities, and departmental resources.","metadata":{"topic":"university_resources","resource_type":"official_website","link_name":"Systems and Industrial Engineering Department website"}}
{"source_id":"university_links","chunk_id":"financial_aid_office","content":"The University of Arizona Scholarships and Financial Aid office website provides detailed information about applying for financial aid, scholarship opportunities, and funding options for all students.","metadata":{"topic":"university_resources","resource_type":"official_website","link_name":"University of Arizona Scholarships and Financial Aid"}}
{"source_id":"university_links","chunk_id":"applications","content":"The University of Arizona Applications website is the central portal for submitting applications to undergraduate and graduate programs at the University of Arizona.","metadata":{"topic":"university_resources","resource_type":"official_website","link_name":"University of Arizona Applications"}}
{"source_id":"university_links","chunk_id":"arizona_online","content":"Arizona Online provides information about online degree programs, distance learning options, and resources specifically for online students at the University of Arizona.","metadata":{"topic":"university_resources","resource_type":"official_website","link_name":"Arizona Online"}}
{"source_id":"university_links","chunk_id":"career_development","content":"The University of Arizona Student Engagement and Career Development website offers resources for career exploration, job search strategies, internship opportunities, and professional development for students and alumni.","metadata":{"topic":"university_resources","resource_type":"official_website","link_name":"University of Arizona Student Engagement and Career Development"}}
{"source_id":"system_capabilities","chunk_id":"language_support","content":"The ChatBot system supports natural language processing in English, allowing users to ask questions and receive responses in conversational English.","metadata":{"topic":"system_features","capability":"language_support","languages":["English"]}}
{"source_id":"system_capabilities","chunk_id":"multi_turn","content":"The ChatBot supports multi-turn conversations and maintains context over at least 3 turns, allowing for natural back-and-forth dialogue with users.","metadata":{"topic":"system_features","capability":"conversation_management","context_turns":3}}
{"source_id":"system_capabilities","chunk_id":"interruption_handling","content":"The ChatBot can handle conversation interruptions for up to 3 minutes and resume conversations based on previous context before timing out.","metadata":{"topic":"system_features","capability":"interruption_handling","timeout_minutes":3}}
{"source_id":"system_capabilities","chunk_id":"clarification","content":"If the ChatBot is unable to understand a user's query, it will ask for clarification or corrections, or allow the user to cancel the request.","metadata":{"topic":"system_features","capability":"clarification_requests"}}
{"source_id":"system_capabilities","chunk_id":"unexpected_input","content":"The ChatBot handles unexpected inputs, such as off-topic questions or irrelevant conversation, and provides graceful fallback responses to guide users back to relevant topics.","metadata":{"topic":"system_features","capability":"error_handling"}}
{"source_id":"system_capabilities","chunk_id":"response_time","content":"The ChatBot generates responses within 5 seconds of receiving a user query or request, ensuring quick and efficient interactions.","metadata":{"topic":"system_features","capability":"performance","response_time_seconds":5}}
{"source_id":"system_capabilities","chunk_id":"accuracy_target","content":"The ChatBot responds to user queries with 80% accuracy, as measured by unit tests of factual queries with verifiable answers.","metadata":{"topic":"system_features","capability":"accuracy","accuracy_percentage":80,"minimum_test_cases":20}}
{"source_id":"system_capabilities","chunk_id":"intent_extraction","content":"The ChatBot identifies and extracts intents and entities from user text-based input with at least 80% accuracy, enabling effective understanding of user needs.","metadata":{"topic":"system_features","capability":"natural_language_processing","accuracy_percentage":80}}
{"source_id":"system_capabilities","chunk_id":"no_login_required","content":"General users can access the ChatBot without requiring a login, user account, or providing any personally identifiable information (PII), ensuring easy and anonymous access.","metadata":{"topic":"system_features","capability":"user_access","authentication_required":false}}
{"source_id":"system_capabilities","chunk_id":"privacy","content":"The ChatBot does not store any personally identifiable information (PII) beyond the active session with the user, protecting user privacy and data security.","metadata":{"topic":"system_features","capability":"data_protection","pii_storage":"session_only"}}
{"source_id":"bs_curriculum","chunk_id":"year1_fall_courses","content":"BS Software Engineering Year 1 Fall semester typically includes: MATH 122B or MATH 125 (Calculus I, 3-4 units), CHEM 151 or PHYS 141 (General Chemistry or Physics, 3-4 units with lab), ENGL 101 or 107 (First-Year Composition, 3 units), SFWE 101 (Introduction to Software Engineering, 3 units, co-requisite with Math), and a Tier I General Education course (3 units). Total: approximately 15-17 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":1,"semester":"Fall","total_units":"15-17"}}
{"source_id":"bs_curriculum","chunk_id":"year1_spring_courses","content":"BS Software Engineering Year 1 Spring semester typically includes: MATH 129 (Calculus II, 4 units), PHYS 141 or CHEM 151 (Physics or Chemistry, 3-4 units with lab if not taken in Fall), ECE 175 (Computer Programming for Engineering Applications in C, 3 units, prerequisite or concurrent with MATH 122B/125), ENGL 102, 108, or 109H (First-Year Composition, 3 units), and a Tier I General Education course (3 units). Total: approximately 16-18 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":1,"semester":"Spring","total_units":"16-18"}}
{"source_id":"bs_curriculum","chunk_id":"year2_fall_courses","content":"BS Software Engineering Year 2 Fall semester typically includes: MATH 223 (Vector Calculus, 3 units), PHYS 241 (Introductory Electricity and Magnetism, 3 units, prerequisite MATH 129 and PHYS 141), ECE 201 (Network Analysis I, 4 units, prerequisite or concurrent MATH 223), SFWE 201 (Software Engineering Sophomore Colloquium, 1 unit, prerequisite SFWE 101), ECE 101 (Programming I in C, 3 units, prerequisite or concurrent MATH 122B/125), and a General Education course. Students must achieve Advanced Standing before enrolling in 300-level courses. Total: approximately 15-17 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":2,"semester":"Fall","total_units":"15-17","notes":"Advanced Standing required for 300-level courses"}}
{"source_id":"bs_curriculum","chunk_id":"year2_spring_courses","content":"BS Software Engineering Year 2 Spring semester typically includes: MATH 254 (Introduction to Ordinary Differential Equations, 3 units), ECE 275 (Data Structures and Algorithms in Java, 3 units, prerequisite ECE 101 and concurrent or prerequisite MATH 129), PHYS 143 (Physics Lab for PHYS 241, 1 unit), MATH 313 (Introduction to Linear Algebra, 3 units), and General Education courses (6 units). Total: approximately 16 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":2,"semester":"Spring","total_units":"16"}}
{"source_id":"bs_curriculum","chunk_id":"year3_fall_courses","content":"BS Software Engineering Year 3 Fall semester typically includes: SFWE 301 (Software Requirements Analysis and Test, 3 units, prerequisite Advanced Standing and ECE 275), CSC 345 (Analysis of Discrete Structures, 3 units, prerequisite MATH 223), ECE 220 (Digital Logic, 4 units, prerequisite or concurrent MATH 254 and ECE 101), and Technical Electives or General Education courses (6 units). Total: approximately 16 units. Advanced Standing in Engineering is required.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":3,"semester":"Fall","total_units":"16","prerequisite":"Advanced Standing"}}
{"source_id":"bs_curriculum","chunk_id":"year3_spring_courses","content":"BS Software Engineering Year 3 Spring semester typically includes: SFWE 302 (Software Architecture and Design, 3 units, prerequisite Advanced Standing and SFWE 301), SFWE 401 (Software Assurance and Security, 3 units, co-requisite ECE 275), CSC 355 (Introduction to Software Engineering Principles and Practices, 3 units), and Technical Electives or General Education courses (6 units). Total: approximately 15 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":3,"semester":"Spring","total_units":"15"}}
{"source_id":"bs_curriculum","chunk_id":"year4_fall_courses","content":"BS Software Engineering Year 4 Fall semester typically includes: SFWE 403 (Software Project Management, 3 units), SFWE 411 (Software for Industrial Control Systems, 3 units, co-requisite ECE 275 and SFWE 401), Technical Electives (6-9 units), and remaining General Education requirements. Students work on capstone preparation. Total: approximately 15-16 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":4,"semester":"Fall","total_units":"15-16"}}
{"source_id":"bs_curriculum","chunk_id":"year4_spring_courses","content":"BS Software Engineering Year 4 Spring semester typically includes: SFWE 402 (Software DevSecOps, 4 units, prerequisite ECE 275), Senior Capstone Design Project, remaining Technical Electives, and any remaining General Education requirements. Students complete their degree requirements and prepare for graduation. Total: approximately 14-16 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","year":4,"semester":"Spring","total_units":"14-16"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_101","content":"SFWE 101: Introduction to Software Engineering (3 units). This course introduces students to different software development lifecycle (SDLC) phases used in developing, delivering, and maintaining software products. Students acquire basic software development skills using Python, learn traditional coding standards and guidelines, and explore Python development libraries and debugging tools. The course lays the foundation for academic and career success in Software Engineering. Co-requisite: MATH 122B or MATH 125. Usually offered: Fall, Spring.","metadata":{"topic":"course_details","course_code":"SFWE 101","units":3,"prerequisites":"None","corequisites":"MATH 122B or MATH 125","typical_semester":"Fall, Spring"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_201","content":"SFWE 201: Software Engineering Sophomore Colloquium (1 unit). A colloquium designed to help students explore different career opportunities for Software Engineering professionals. Students interact with and learn from professional software engineers while exploring various roles. The course helps students determine focus areas within the SFWE degree program and prepare professional resumes. Prerequisite: SFWE 101. Usually offered: Fall, Spring.","metadata":{"topic":"course_details","course_code":"SFWE 201","units":1,"prerequisites":"SFWE 101","typical_semester":"Fall, Spring"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_301","content":"SFWE 301: Software Requirements Analysis and Test (3 units). Students learn to derive and develop software requirements that are measurable, testable, and lead to compliant software design and implementation. Using industry best practices and tools, students learn to elicit, analyze, specify, and validate functional and non-functional software requirements. Students develop requirements models, specifications, test plans, and test procedures using Java language constructs. Prerequisite: Advanced Standing and ECE 275. Usually offered: Fall.","metadata":{"topic":"course_details","course_code":"SFWE 301","units":3,"prerequisites":"Advanced Standing and ECE 275","typical_semester":"Fall"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_302","content":"SFWE 302: Software Architecture and Design (3 units). This course explores current processes, methods, and tools used in modeling and designing software systems. Working in teams, students develop a software design utilizing industry best practices, common design patterns, and UML modeling tools. Students analyze software quality attributes in design decision making and ensure traceability between requirements, designs, and code implementation. Prerequisite: Advanced Standing and SFWE 301. Usually offered: Spring.","metadata":{"topic":"course_details","course_code":"SFWE 302","units":3,"prerequisites":"Advanced Standing and SFWE 301","typical_semester":"Spring"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_401","content":"SFWE 401: Software Assurance and Security (3 units). Students learn to develop and utilize secure software coding standards and defensive programming techniques to ensure software functions in its intended manner, free from coding errors and inadvertent bugs. This course promotes software integrity, security, quality, and reliability. Co-requisite: ECE 275. Usually offered: Spring.","metadata":{"topic":"course_details","course_code":"SFWE 401","units":3,"prerequisites":"None","corequisites":"ECE 275","typical_semester":"Spring"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_402","content":"SFWE 402: Software DevSecOps (4 units). Students develop software products using a DevSecOps workflow approach with common industry tools. Using DevSecOps workflows and continuous integration/continuous delivery (CI/CD) approaches, students assess if software quality and reliability are increased. Students use tools like GitLab, Jenkins, Docker, and SonarCube. Prerequisite: ECE 275. Usually offered: Spring.","metadata":{"topic":"course_details","course_code":"SFWE 402","units":4,"prerequisites":"ECE 275","typical_semester":"Spring"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_403","content":"SFWE 403: Software Project Management (3 units). Students plan and track progress of software development projects using metrics to monitor team performance, predict cost and schedule execution, develop and assess risk mitigation plans, and measure software quality and maturity. The course covers project management principles applied to software engineering. Co-requisite: ECE 275 and SFWE 401. Usually offered: Fall.","metadata":{"topic":"course_details","course_code":"SFWE 403","units":3,"prerequisites":"None","corequisites":"ECE 275 and SFWE 401","typical_semester":"Fall"}}
{"source_id":"bs_course_details","chunk_id":"sfwe_411","content":"SFWE 411: Software for Industrial Control Systems (3 units). This course addresses Industrial Control Systems (ICS) and cyber-physical systems in the context of the Fourth Industrial Revolution (4IR). Students learn about connected systems that amalgamate artificial intelligence, advanced robotics, smart sensors, and communication networks for industrial automation. Co-requisite: ECE 275 and SFWE 401. Usually offered: Fall.","metadata":{"topic":"course_details","course_code":"SFWE 411","units":3,"prerequisites":"None","corequisites":"ECE 275 and SFWE 401","typical_semester":"Fall"}}
{"source_id":"bs_course_details","chunk_id":"ece_101","content":"ECE 101: Programming I (3 units). Introduction to basic principles of programming and the C programming language. Students learn fundamental software design principles and commonly used techniques to solve computational problems. The course covers program flow control, memory management, and elementary data structures. Prerequisite or concurrent: MATH 112, 120R, 122B, or 125. Usually offered: Fall, Spring.","metadata":{"topic":"course_details","course_code":"ECE 101","units":3,"prerequisites":"MATH 112, 120R, 122B, or 125 (prerequisite or concurrent)","typical_semester":"Fall, Spring"}}
{"source_id":"bs_course_details","chunk_id":"ece_175","content":"ECE 175: Computer Programming for Engineering Applications (3 units). Fundamentals of C programming, complexity and efficiency analysis, numerical precision and representations, introduction to data structures, structured program design, and application to solving engineering problems. Prerequisite or concurrent: MATH 122B or MATH 125.","metadata":{"topic":"course_details","course_code":"ECE 175","units":3,"prerequisites":"MATH 122B or MATH 125 (prerequisite or concurrent)","typical_semester":"Fall, Spring"}}
{"source_id":"bs_course_details","chunk_id":"ece_275","content":"ECE 275: Data Structures and Algorithms (3 units). Study of data structures and algorithms in Java, including complexity analysis, linked lists, stacks, queues, trees, graphs, sorting, and searching algorithms. This course is fundamental for upper-division software engineering courses. Prerequisite: ECE 101 and MATH 129 (prerequisite or concurrent).","metadata":{"topic":"course_details","course_code":"ECE 275","units":3,"prerequisites":"ECE 101 and MATH 129","typical_semester":"Spring"}}
{"source_id":"bs_course_details","chunk_id":"ece_201","content":"ECE 201: Network Analysis I (4 units). Introduction to electrical circuit analysis including resistive circuits, capacitors, inductors, operational amplifiers, and AC circuit analysis. This course provides foundational knowledge for understanding electrical systems. Prerequisite or concurrent: MATH 223.","metadata":{"topic":"course_details","course_code":"ECE 201","units":4,"prerequisites":"MATH 223 (prerequisite or concurrent)","typical_semester":"Fall"}}
{"source_id":"bs_course_details","chunk_id":"ece_220","content":"ECE 220: Digital Logic (4 units). Introduction to digital logic design including Boolean algebra, combinational and sequential logic circuits, and digital system design. Students learn fundamental concepts for computer architecture and digital systems. Prerequisite or concurrent: MATH 254 and prerequisite ECE 101.","metadata":{"topic":"course_details","course_code":"ECE 220","units":4,"prerequisites":"ECE 101 and MATH 254","typical_semester":"Fall"}}
{"source_id":"bs_course_details","chunk_id":"csc_345","content":"CSC 345: Analysis of Discrete Structures (3 units). Mathematical foundations for computer science including logic, sets, relations, functions, recursion, graph theory, and combinatorics. This course provides the mathematical background essential for algorithm analysis and software engineering. Prerequisite: MATH 223.","metadata":{"topic":"course_details","course_code":"CSC 345","units":3,"prerequisites":"MATH 223","typical_semester":"Fall, Spring"}}
{"source_id":"bs_course_details","chunk_id":"csc_355","content":"CSC 355: Introduction to Software Engineering Principles and Practices (3 units). Introduction to software engineering methodologies, software development lifecycle, requirements engineering, software design, testing, and project management. Students work on team-based software projects using industry practices.","metadata":{"topic":"course_details","course_code":"CSC 355","units":3,"prerequisites":"Varies","typical_semester":"Fall, Spring"}}
{"source_id":"bs_curriculum","chunk_id":"math_requirements","content":"BS Software Engineering requires the following mathematics courses: MATH 122B or MATH 125 (Calculus I, 3-4 units), MATH 129 (Calculus II, 4 units), MATH 223 (Vector Calculus, 3 units), MATH 254 (Ordinary Differential Equations, 3 units), and MATH 313 (Linear Algebra, 3 units). Additionally, CSC 345 (Analysis of Discrete Structures, 3 units) provides mathematical foundations for computer science.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"mathematics","total_math_units":"19-20"}}
{"source_id":"bs_curriculum","chunk_id":"science_requirements","content":"BS Software Engineering requires foundational science courses that satisfy General Education Exploring Perspectives (Natural Scientist) requirements. Students must complete: CHEM 151/152/161/162 or PHYS 141/161H (with lab, 3-4 units), PHYS 241 (Introductory Electricity and Magnetism, 3 units), and PHYS 143 (Physics Lab, 1 unit). Total science requirement: approximately 7-8 units.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"science","total_science_units":"7-8"}}
{"source_id":"bs_curriculum","chunk_id":"general_education","content":"BS Software Engineering students must complete University of Arizona General Education requirements including: Tier I courses (6 units of First-Year Composition such as ENGL 101/102/107/108/109H), Tier II courses covering various perspectives and awareness areas (cultural, global, historical), and foundational science courses that meet Natural Science requirements. General Education courses must be distributed throughout the four-year plan.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"general_education"}}
{"source_id":"bs_curriculum","chunk_id":"advanced_standing","content":"Students must achieve Advanced Standing in the College of Engineering before enrolling in 300-level and 400-level engineering courses. Advanced Standing requirements typically include completion of foundational mathematics, science, and programming courses with minimum grade requirements. Students should consult with their academic advisor regarding Advanced Standing eligibility.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"advanced_standing","course_level":"300 and 400"}}
{"source_id":"bs_curriculum","chunk_id":"technical_electives_requirement","content":"BS Software Engineering students must complete pre-approved undergraduate technical electives. Students can choose electives such as web and mobile applications, embedded systems, cloud computing, cybersecurity, and other specialized software engineering topics from across the College of Engineering departments. Technical electives allow students to customize their education based on career interests.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"technical_electives"}}
{"source_id":"bs_curriculum","chunk_id":"total_units","content":"The BS Software Engineering degree requires approximately 120-128 total units for graduation, distributed across four years of full-time study. This includes required SFWE courses, mathematics and science courses, ECE and CSC courses, technical electives, and General Education requirements.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"degree_requirements","total_units":"120-128"}}
{"source_id":"bs_curriculum","chunk_id":"online_vs_campus","content":"The BS Software Engineering program is offered on the main campus in Tucson, through Arizona Online for distance students, and at the Yuma Campus. Online and distance students follow similar course sequences but may have different course delivery formats and scheduling options. Course planning guides are available for both on-campus and online/distance students.","metadata":{"topic":"curriculum","degree_level":"undergraduate","section":"delivery_formats","campuses":["Tucson main campus","Arizona Online","Yuma Campus"]}}


