{"source_id":"ua_sfwe_ms_program","chunk_id":"ms_overview","content":"The Master of Science (MS) in Software Engineering at the University of Arizona is offered through the Systems and Industrial Engineering (SIE) department. The program is housed in the College of Engineering on the Tucson main campus, with graduate advising coordinated through the SFWE Graduate Program Coordinator in the Engineering Building on James E. Rogers Way.","metadata":{"document_title":"MS Software Engineering Program Information","institution":"University of Arizona","department":"Systems and Industrial Engineering (SIE)","degree_type":"Master of Science (MS) in Software Engineering","last_updated":"2024-2025","contact_email":"sfwe-grad@engr.arizona.edu","contact_phone":"See Graduate Program Coordinator","office_location":"1127 E. James E. Rogers Way, Room 111, Tucson, AZ 85721-0020"}}
{"source_id":"ua_sfwe_ms_program","chunk_id":"admission_requirements","content":"Applicants to the MS in Software Engineering must hold a BS degree from a regionally accredited U.S. institution or an equivalent international university recognized by the University of Arizona, with a minimum 3.0 GPA overall or in the last 60 units of the undergraduate degree. They must demonstrate proficiency in at least one programming language or have 1–2 years of software development industry experience. Required application materials include academic transcripts, a statement of purpose, three letters of recommendation, and a resume or CV. Students from non-SFWE backgrounds may be assigned deficiency courses before enrolling in graduate-level classes. The GRE is not required for regular admission.","metadata":{"topic":"MS Admission Requirements","category":"Admissions","minimum_gpa":3.0,"gpa_details":"Minimum 3.0 cumulative GPA in overall undergraduate degree OR in the last 60 units of undergraduate degree","degree_requirement":"BS degree from a regionally accredited USA university or equivalent international university recognized by UArizona","technical_requirements":["Proficiency in at least 1 programming language","OR 1-2 years of industry experience in a software-development position"],"application_materials":["Academic transcripts","Statement of purpose describing intent and motivation to pursue graduate degree in SFWE","Three letters of recommendation","Resume or curriculum vitae"],"application_portal":"https://apply.grad.arizona.edu/users/login","application_deadline_info":"https://sfwe.engineering.arizona.edu/grad-programs/admissions","deficiency_courses":"Students with BS degrees in disciplines not directly related to Software Engineering may be required to complete undergraduate deficiency courses prior to enrolling in graduate courses","gre_requirement":"GRE not required for regular admission"}}
{"source_id":"ua_sfwe_ms_program","chunk_id":"degree_requirements","content":"The MS in Software Engineering requires a minimum of 30 units of graduate credit in courses numbered 500-level or above. Credits from SFWE 695A, SFWE 900, and SFWE 920 do not count toward the 30 required units. Students must maintain a minimum GPA of 3.0, earn at least a C in all courses applied to the degree, and receive A or B (or equivalent) in any transfer credits. Students may complete the degree via thesis, report, or non-thesis coursework-only options. A plan of study should be submitted in GradPath before the end of the first year, and no single course can be counted toward more than two degrees across any institution.","metadata":{"topic":"MS Degree Requirements","category":"Degree Requirements","minimum_units":30,"unit_level":"Graduate credit (courses numbered 5xx, 6xx, 9xx)","excluded_credits":["SFWE 695A","SFWE 900","SFWE 920"],"performance_requirements":{"minimum_gpa":3.0,"minimum_course_grade":"C","transfer_credit_minimum_grade":"A or B"},"degree_options":["Thesis","Report","Non-Thesis Coursework"],"plan_of_study_deadline":"Students are encouraged to submit completed plan of study through GradPath before the end of the first year in the program","course_counting_rule":"No course may be counted toward the requirements for more than two degrees (earned at any institution)"}}
{"source_id":"ua_sfwe_ms_program","chunk_id":"thesis_option","content":"The thesis option in the MS Software Engineering program is intended for students who wish to work closely with a faculty member on a specific research topic and is strongly recommended for those planning to pursue a PhD. The thesis is prepared under the guidance of the faculty advisor, reviewed by an examining committee, and then orally defended. After committee approval, the thesis must be submitted to the Graduate College for formatting review and publication in the university repository. The examining committee must include at least three members: the faculty advisor as chair, at least two members of the Graduate Faculty, and an optional third approved special member. A complete draft must be distributed to the committee at least two weeks before the defense, and the committee should ideally reflect the student’s research interests.","metadata":{"topic":"MS Thesis Option","category":"Degree Options","description":"Thesis work is designed for students who wish to work with a faculty member on a specific research topic","thesis_process":"Prepared under guidance of faculty advisor and reviewed by examining committee prior to oral presentation","submission_requirement":"Thesis must be submitted to Graduate College for formatting review and publishing in campus repository","recommended_for":"Students wishing to pursue a Doctoral degree are encouraged to choose the thesis option","committee_requirements":{"minimum_members":3,"chair":"Faculty advisor","graduate_faculty_required":2,"special_member_allowed":"Third member may be approved special member if not Graduate Faculty"},"committee_appointment":"Submit Committee Appointment form through GradPath once committee is formed","thesis_draft_deadline":"Complete draft must be shared with all committee members at least two weeks prior to anticipated defense date","committee_formation_guidance":"Committee will ideally include faculty in student's area of interest. Faculty advisor may have suggestions on potential committee members"}}
{"source_id":"ua_sfwe_ms_program","chunk_id":"research_advisor","content":"MS students interested in research are required to identify a faculty research advisor before the end of their first year in the program. At the beginning of each term, faculty hold a Zoom session where they briefly present their background and research areas. Students then reach out to faculty whose research aligns with their interests to explore potential matches. Once a student and faculty member agree to work together, the student must inform the Graduate Program Coordinator. Detailed faculty profiles and research areas are available on the SFWE faculty webpage.","metadata":{"topic":"Faculty Research Advisor","category":"Academic Advising","requirement":"MS students interested in pursuing research are required to identify a research advisor before the end of their first year in the program","process":["At beginning of each term there will be a Zoom presentation where faculty provide short bio and research information","Students contact faculty in research area of interest to see if they are good match","Once student and faculty member agree to work together, student informs Graduate Program Coordinator"],"faculty_list":"https://sfwe.engineering.arizona.edu/faculty (SFWE Faculty list with research areas and contact information)"}}
{"source_id":"ua_sfwe_ms_program","chunk_id":"amp_overview","content":"The Accelerated Master’s Program (AMP) in Software Engineering allows exceptional University of Arizona undergraduates to begin graduate coursework while finishing their BS degree and to double count up to 12 units of approved graduate courses toward both the BS and MS. Students may apply after completing at least 75 eligible undergraduate credits and, at entry to the program, must have at least 90 credits completed, a minimum 3.3 GPA, and at least 12 earned SFWE credits in the major at UA. AMP students work with both the SFWE Graduate Program Coordinator and their undergraduate advisor to plan their coursework. Those pursuing a thesis or report must identify a faculty advisor and submit a preliminary proposal and plan of study by the end of their first semester in AMP. The GRE is not required for AMP admission.","metadata":{"topic":"Accelerated Master's Program (AMP)","category":"Special Programs","description":"Designed to allow exceptional undergraduate seniors at University of Arizona to work concurrently toward MS degree","shared_units":"Up to 12 units of approved graduate coursework taken in undergraduate career may count towards both BS and MS degrees","application_timing":"Students may apply after completion of minimum of 75 eligible undergraduate credits","admission_requirements":{"minimum_gpa":3.3,"minimum_undergraduate_credits_at_entry":90,"minimum_sfwe_credits":"At least 12 earned undergraduate credits in SFWE major at University of Arizona (SFEBSSFE)","excluded_credits":"Units graded Incomplete, Pass/Fail or taken as audit will not count","application_materials":["One letter of recommendation","Statement of purpose"],"gre_required":false},"academic_policies":"Students must see SFWE Graduate Program Coordinator and SFWE Undergraduate Advisor to discuss plan of study. Students pursuing MS thesis or report must select faculty advisor and submit preliminary thesis/report proposal and plan of study before end of first semester after AMP admission","additional_info":"https://catalog.arizona.edu/policy/accelerated-masters-program-amp#policies"}}
{"source_id":"ua_sfwe_ms_program","chunk_id":"core_courses","content":"MS Software Engineering students complete a set of core courses that establish advanced skills in requirements, architecture, distributed systems, and fundamental software engineering concepts. The core courses are SFWE 504 Software Requirements Analysis & Testing (3 units), SFWE 505 Software Architecture & Design (3 units), SFWE 506 Distributed Computing (3 units), and SFWE 507 Foundations of Software Engineering (3 units). Students then choose additional technical electives to reach the 30-unit minimum required for the degree.","metadata":{"topic":"MS Core Courses","category":"Required Coursework","core_courses":[{"course_code":"SFWE 504","course_title":"Software Requirements Analysis & Testing","units":3},{"course_code":"SFWE 505","course_title":"Software Architecture & Design","units":3},{"course_code":"SFWE 506","course_title":"Distributed Computing","units":3},{"course_code":"SFWE 507","course_title":"Foundations of Software Engineering","units":3}],"note":"Students must complete core courses plus technical electives to reach 30 units minimum"}}

