{"source_id":"ua_sfwe_phd_program","chunk_id":"phd_overview","content":"The PhD in Software Engineering at the University of Arizona is offered through the Systems and Industrial Engineering (SIE) department. It is designed for individuals wishing to pursue advanced research and scholarly work in software engineering and related areas. The program is housed in the College of Engineering on the Tucson main campus, with graduate advising available via the SFWE Graduate Program Coordinator.","metadata":{"document_title":"PhD Software Engineering Program Information","institution":"University of Arizona","department":"Systems and Industrial Engineering (SIE)","degree_type":"Doctor of Philosophy (PhD) in Software Engineering","last_updated":"2024-2025","contact_email":"sfwe-grad@engr.arizona.edu","contact_phone":"See Graduate Program Coordinator","office_location":"1127 E. James E. Rogers Way, Room 111, Tucson, AZ 85721-0020","program_description":"Designed for individuals wishing to pursue advanced research and scholarly work"}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"admission_requirements","content":"PhD applicants in Software Engineering must hold a BS degree from a regionally accredited U.S. university or an equivalent international institution recognized by the University of Arizona. A minimum 3.0 cumulative GPA is required either overall or in the last 60 units of the undergraduate degree. Applicants should demonstrate proficiency in at least one programming language or have 1–2 years of software-development industry experience. A master’s degree is not required, but admitted PhD students may earn an MS in SFWE en route to the PhD. Application materials typically include transcripts, a statement of purpose, three letters of recommendation, and a resume or CV. Students from non-SFWE backgrounds may be assigned undergraduate deficiency courses.","metadata":{"topic":"PhD Admission Requirements","category":"Admissions","ms_degree_required":false,"ms_enroute_option":"Admitted PhD students have option to earn SFWE MS degree enroute to their PhD. Contact Graduate Program Coordinator during second year","minimum_gpa":3.0,"gpa_details":"Minimum 3.0 cumulative GPA in overall undergraduate degree OR in the last 60 units of undergraduate degree","degree_requirement":"BS degree from a regionally accredited USA university or equivalent international university recognized by UArizona","technical_requirements":["Proficiency in at least 1 programming language","OR 1-2 years of industry experience in a software-development position"],"application_materials":["Academic transcripts","Statement of purpose describing intent and motivation to pursue graduate degree in SFWE","Three letters of recommendation","Resume or curriculum vitae"],"application_portal":"https://apply.grad.arizona.edu/users/login","application_deadline_info":"https://sfwe.engineering.arizona.edu/grad-programs/admissions","deficiency_courses":"Students with BS degrees in disciplines not directly related to Software Engineering may be required to complete undergraduate deficiency courses"}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"coursework_plan_of_study","content":"The SFWE PhD degree requires a minimum of 68 graduate units, including 48 units of non-dissertation coursework, 12 units in a doctoral minor, 18 units of dissertation research, and 2 units of graduate colloquium. The Plan of Study serves as a contract with the university specifying which courses must be completed before the PhD can be awarded. Students must maintain at least a 3.0 GPA, earn a minimum of C in each course, and ensure that any transfer credits are A or B equivalents. In addition to coursework, students are expected to actively participate in research under the mentorship of a faculty advisor.","metadata":{"topic":"PhD Coursework and Plan of Study","category":"Degree Requirements","total_minimum_units":68,"breakdown":{"non_dissertation_coursework":48,"minor_coursework":12,"dissertation_research":18,"graduate_colloquium":2},"plan_of_study":"Contract with university regarding specific course requirements that student must satisfy before becoming eligible for PhD degree","performance_requirements":{"minimum_gpa":3.0,"minimum_course_grade":"C","transfer_credit_minimum_grade":"A or B","additional_requirement":"Actively participate in and contribute to research activities with mentorship from faculty advisor"}}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"transfer_credits","content":"PhD students in Software Engineering may transfer up to 30 units of relevant graduate coursework from a prior master’s or other graduate program with approval from their faculty advisor. Only coursework (not thesis or research credits) can be applied, and all transferred courses must have been completed with grades of A or B or the equivalent at the original institution.","metadata":{"topic":"PhD Transfer Credits","category":"Degree Requirements","masters_coursework_transfer":"With approval from faculty advisor, graduate coursework applied toward master's degree may be applied toward PhD","masters_non_coursework":"Non-coursework credits (e.g., thesis or research credits) from master's degree cannot be applied toward PhD degree","maximum_transfer_units":30,"transfer_restrictions":["Maximum of 30 units of relevant coursework from another graduate degree may be transferred","Credits must be reviewed and approved by student's faculty advisor","Minimum grade for transferred credits must be A, B, or equivalent at institution where courses were taken"]}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"core_required_courses","content":"PhD students in Software Engineering must complete 15 units of SFWE core coursework. This includes 6 units from two required courses—SFWE 513 Software Engineering Research Methods (3 units) and SFWE 507 Foundations of Software Engineering (3 units)—plus 9 additional units drawn from SFWE 502, 503, 504, 505, or 506.","metadata":{"topic":"PhD Core Required Courses","category":"Required Coursework","required_core":[{"course_code":"SFWE 513","course_title":"Software Engineering Research Methods","units":3},{"course_code":"SFWE 507","course_title":"Foundations of Software Engineering","units":3}],"additional_core_requirement":"9 units from SFWE 502, 503, 504, 505, 506","additional_core_options":[{"course_code":"SFWE 502","course_title":"Software DevSecOps","units":4},{"course_code":"SFWE 503","course_title":"Software Project Management","units":3},{"course_code":"SFWE 504","course_title":"Software Requirements Analysis & Testing","units":3},{"course_code":"SFWE 505","course_title":"Software Architecture & Design","units":3},{"course_code":"SFWE 506","course_title":"Distributed Computing","units":3}],"total_core_units":15}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"colloquium_requirement","content":"PhD students must enroll in 2 units of SFWE 695A Graduate Seminar/Colloquium, graded on a pass/fail basis. While enrolled, students are required to attend department seminars and, before completing the requirement, deliver a research presentation to the class. After completing the 2 units, students are strongly encouraged to continue attending seminars relevant to their research.","metadata":{"topic":"PhD Graduate Seminar/Colloquium Requirement","category":"Required Coursework","course_code":"SFWE 695A","units_required":2,"grading":"Pass/Fail","attendance_requirement":"Students must attend department seminars during each semester where they are enrolled in SFWE 695A","presentation_requirement":"Prior to completing seminar requirement, student must give research presentation to class","post_completion_recommendation":"After completing seminar requirement, students are highly encouraged to continue attending graduate seminars of interest to their research area"}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"independent_study_policy","content":"PhD students may count up to 3 units of SFWE 699 Independent Study toward their degree, provided the study covers a topic not offered through regular courses and the detailed plan is approved by the Graduate Studies Committee. SFWE 900 research credits cannot be counted toward the PhD degree requirements.","metadata":{"topic":"PhD Independent Study Credits","category":"Coursework Policies","course_code":"SFWE 699","maximum_units":3,"requirements":["Independent study must cover a topic not available through regular courses","Detailed course plan must be submitted to and approved by Graduate Studies Committee"],"sfwe_900_policy":"SFWE 900 research credits may not be counted toward PhD Degree"}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"doctoral_minor_requirement","content":"All SFWE PhD students must complete 12 units in a doctoral minor outside of SFWE. A minor advisor from the minor department is required and typically serves on the student’s comprehensive exam committee. Common minor fields include Systems & Industrial Engineering, Computer Science, Information Science, Statistics, Biomedical Engineering, Computer Engineering, Mechanical Engineering, and other engineering programs. Students may also pursue a split minor, completing 6 units in each of two minor programs, or a multidisciplinary minor, depending on program policies.","metadata":{"topic":"PhD Doctoral Minor Requirement","category":"Minor Requirements","required_units":12,"minor_location":"Outside of SFWE","minor_advisor":"Required from minor department/program","common_minor_programs":["Systems & Industrial Engineering","Computer Science","Information Science","Statistics","Biomedical Engineering","Computer Engineering","Mechanical Engineering","Other engineering programs"],"split_minor_option":"6 units in each of two minor programs","multidisciplinary_minor_option":true,"minor_advisor_role":"Typically serves on student's comprehensive exam committee. Participation in final dissertation committee is at discretion of student's major advisor"}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"sfwe_phd_minor_for_non_sfwe","content":"Doctoral students from other departments may choose to minor in Software Engineering by completing 12 SFWE units. The minor requires 6 units from SFWE core-area courses (such as SFWE 507, 502, 503, 504, 505, or 506) and 6 units of approved SFWE electives (including options like SFWE 501, 508–513). For split minors, students typically complete 6 units from SFWE core courses and 6 units from another program. Students must identify a SFWE faculty member to serve as their minor advisor.","metadata":{"topic":"PhD Minor in SFWE (for non-SFWE PhD students)","category":"Minor Requirements","description":"Doctoral students in any department/program outside of SFWE may choose to minor in SFWE","total_units":12,"requirements":{"core_area_courses":{"units":6,"options":["SFWE 507","SFWE 502","SFWE 503","SFWE 504","SFWE 505","SFWE 506"]},"approved_electives":{"units":6,"options":["SFWE 501","SFWE 508","SFWE 509","SFWE 510","SFWE 511","SFWE 512","SFWE 513"]}},"split_minor":"A minor split between SFWE and another department requires 6 units from SFWE core area courses and 6 units from other program","minor_advisor_requirement":"Students intending to minor in SFWE should first identify a SFWE faculty as their minor advisor"}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"qualifying_exam","content":"The PhD Qualifying Exam (QE) in Software Engineering evaluates a student’s prerequisite knowledge before they begin intensive research. Students must take the QE by the end of their third semester. A Qualifying Exam Committee of 3–5 College of Engineering faculty, chaired by the student’s advisor, designs an exam based on the student’s graduate coursework and plan of study. The exam, typically a closed oral and/or written session of 45 minutes up to 3 hours, is approved one month in advance by the SFWE Graduate Studies director. The committee votes pass/fail by secret ballot; any majority of fail votes (including abstentions) results in failure. Students who fail may retake the QE once in the following semester, with at least one member from the original committee. Failing the second attempt results in removal from the SFWE PhD program.","metadata":{"topic":"PhD Doctoral Qualifying Exam (QE)","category":"Examinations","purpose":"Evaluate prerequisite knowledge required to undertake research in student's area of interest in Software Engineering","timing":"Required to be taken prior to end of third semester","committee":{"name":"Qualifying Exam Committee (QEC)","minimum_members":3,"maximum_members":5,"composition":"College of Engineering faculty","chair":"Student's Faculty Advisor","formation":"Chair works with student to identify rest of QEC"},"content_basis":"Graduate level courses in software engineering and related disciplines based on each student's plan of study","approval_process":"Content submitted by advisor for approval by Director of SFWE Graduate Studies Committee one month prior to exam","student_preparation":"Student allowed to request meetings with QEC members in advance to discuss scope of exam and appropriate review topics","format":"Closed session exam administered through combination of oral/written questions on priorly identified topics","duration":"At least 45 minutes, cannot last more than 3 hours","evaluation":"Committee votes pass/fail in secret ballot. Majority fail vote results in failure (abstaining equals negative vote)","retake_policy":"Students failing first time allowed second and last attempt in following semester. QEC for second attempt can request access to results of first QE and must have at least one member from first QEC","failure_consequence":"Failure to pass QE on second attempt results in removal from SFWE PhD program"}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"comprehensive_exam","content":"The Doctoral Comprehensive Exam determines whether a SFWE PhD student has sufficient background to undertake their planned dissertation research. It includes written and oral components covering both major and minor fields. For the written portion, committee members pose questions based on the student’s dissertation proposal and specialization; students usually have several weeks to respond, and each member rates responses as pass or fail, potentially requesting revisions once. After successful written work, the oral exam typically includes a presentation on the proposed research and is evaluated on literature review, research depth/originality, and communication, each scored from 1 to 5. Passing requires scores of 3 or higher in all criteria from all committee members. The exam is usually taken at least one semester to a year before the final defense, and at least 9 months is recommended. Students may be allowed one retake of the oral comprehensive exam within four months, at the committee’s discretion. The committee generally has at least four members, including major and minor advisors and a minor representative.","metadata":{"topic":"PhD Doctoral Comprehensive Exam","category":"Examinations","purpose":"Determine whether student has developed sufficient background and expertise for research in field of planned dissertation. Successful completion leads to formal admission to PhD candidacy","format":"Includes written and oral portions covering major and minor areas","written_exam":{"process":["Student sends summary of dissertation proposal to committee","Each committee member develops set of questions related to student's area of specialization and proposed dissertation","Timeline for response: few weeks to a month (determined by each committee member)","Each committee member assesses outcome as pass or fail","Committee member may ask for clarifications or revisions once","Satisfactory response to all questions from each member constitutes pass"]},"oral_exam":{"timing":"After completing all written portions","presentation":"Typically includes presentation based on proposed dissertation research","evaluation_criteria":["Extent of pertinent literature review and analyses","Depth and originality of research problem and methods","Communication"],"scoring":"Each criterion rated 1 to 5 by each committee member. Score of 3 or above on all three areas from all members is pass","candidacy":"When student passes oral comprehensive exam, recommended to Graduate College for acceptance as PhD candidate"},"timing_recommendation":"Typically taken at least a semester to a year before final dissertation defense. Recommended at least 9 months before final defense","retake_policy":"At committee discretion, student may repeat oral comprehensive exam once within four months, incorporating specific recommendations from committee members","committee":{"minimum_members":4,"composition":["Three members including major and minor advisors must be current tenured, tenure track, or approved tenure equivalent faculty","One member must be minor representative","Fourth member may be approved special member"],"minor_advisor_participation":"May choose to waive written portion but required to participate in oral comprehensive exam"}}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"final_exam_dissertation_defense","content":"The final examination for the SFWE PhD consists of the written dissertation and the public oral defense. The dissertation must clearly state the significance of the work, thoroughly review relevant literature, describe methods, present major findings, and discuss limitations, impact, and future research directions. Students must follow Graduate College formatting guidelines and share the dissertation with all committee members at least two weeks before the defense. The defense includes a public presentation and discussion of the research followed by a closed session with the committee. The committee evaluates the candidate’s ability to critically engage with the literature, formulate and solve original problems using SFWE methods, and clearly communicate research contributions. The defense must be publicly announced at least two weeks in advance via the GradPath Announcement of Oral Examination form. At least three qualified faculty members must serve on the dissertation committee, and all are expected to attend the entire defense.","metadata":{"topic":"PhD Doctoral Final Exam: Written Dissertation and Final Oral Defense","category":"Examinations","purpose":"Assess merit and contributions of candidate's doctoral research. Culmination of candidate's original research conducted during PhD program","written_dissertation":{"required_content":["Significance of the work","Detailed review of relevant literature","Methodologies employed and/or developed","Significant findings from the work","Critical discussion of findings, limitations, and impact","Potential for future research"],"format_determined_by":"Faculty advisor","formatting_guidelines":"https://grad.arizona.edu/gsas/dissertations-theses/dissertation-and-thesis-formatting-guides","sharing_deadline":"Electronic version shared with all committee members at least two weeks prior to oral defense"},"final_oral_defense":{"scheduling":"When both candidate and faculty advisor agree that proposed dissertation research is complete, rigorous, and of high quality","public_announcement":"Exact time and place must be announced publicly at least two weeks in advance","announcement_form":"Announcement of Oral Examination Form submitted via GradPath at least 10 business days prior","format":["Public presentation and discussion","Closed meeting with committee for further evaluation"],"evaluation_criteria":["Identify and critically evaluate relevant literature","Formulate and solve original problems using SFWE methods","Interpret and communicate research ideas and findings"],"defense_guidelines":"https://arizona.app.box.com/v/grad-gsas-finaldefnsinstr"},"committee":{"minimum_members":3,"all_must_be":"Current University of Arizona faculty (tenured, tenure-track, or approved tenure equivalent)","additional_members":"Fourth and additional members can be tenured, tenure-track, or approved special members","attendance_requirement":"All dissertation committee members expected to attend entire final defense"}}}
{"source_id":"ua_sfwe_phd_program","chunk_id":"funding_opportunities","content":"SFWE PhD students may be supported through Graduate Teaching Assistantships (GTA), Graduate Research Assistantships (GRA), tuition scholarships, and competitive fellowships. GTA positions are limited, competitively awarded, and typically capped at six semesters for PhD students; online students are generally not eligible. GRA positions depend on faculty research grants and are arranged directly with faculty members. Tuition scholarships provide partial tuition waivers for students enrolled in at least nine graduate units and in good academic standing. The College of Engineering and Graduate College also offer fellowships, including the University Fellows Program, for highly qualified PhD students. Students funded by the SIE department must enroll in at least nine graduate units each semester to maintain their appointment.","metadata":{"topic":"PhD Funding Opportunities","category":"Financial Support","teaching_assistantships":{"type":"Graduate Teaching Assistantships (GTA)","availability":"Limited amounts, allocated on competitive basis","priority":"Given to incoming students with outstanding potential and continuing students making satisfactory progress","maximum_duration":"Six semesters for PhD students","eligibility":"Online students generally not eligible"},"research_assistantships":{"type":"Graduate Research Assistantships (GRA)","availability":"Limited number for students exceptionally well-prepared to aid faculty research","funding_source":"Faculty members with grant funding","application_process":"Discuss availability and requirements with faculty advisor"},"tuition_scholarships":{"description":"Provides partial tuition waivers","eligibility":["Enrolled for nine or more graduate units","In good academic standing"],"availability":"Limited number each semester"},"fellowships":{"college_fellowships":"College of Engineering offers range of graduate fellowships to highly qualified PhD students. SFWE Graduate Studies Committee nominates current and incoming students","university_fellows_program":"Flagship initiative of Graduate College offered to highest-ranked incoming doctoral students. SFWE Graduate Studies Committee nominates two incoming doctoral students annually","university_fellows_info":"https://gradcenter.arizona.edu/university-fellows-program"},"minimum_registration_funded":"Students funded by SIE Department required to enroll in at least nine graduate units every semester to maintain appointment","graduate_college_funding_info":"https://grad.arizona.edu/funding"}}


