{"source_id":"research_opportunities", "chunk_id":"generic_research_opportunities_overview", "content":"Globally recognized faculty and students collaborate across the campus and around the world to tackle challenges in health care, cybersecurity, big data and transportation. Ongoing research involving software engineering includes: Autonomous systems and robotics, Communications, coding and information theory, Computer architecture and cloud/distributed computing, Data analytics, informatics and machine learning, Embedded systems, Wireless networking, security and systems", "metadata":{"topic":"research_opportunities_overview", "program":"software_engineering", "tags":["research", "opportunities", "overview"]}}
{"source_id":"research_opportunities", "chunk_id":"autonomous_systems_and_robotics_research", "content":"Research in autonomous systems and robotics covers the design, development and deployment of intelligent, often safety-critical systems, including unmanned vehicles, robotic manipulators, human-robot interfaces and smart infrastructure. It engages software engineering for real-time control, autonomy algorithms, system integration, verification and validation." , "metadata":{"topic":"autonomous_systems_and_robotics", "program":"software_engineering", "tags":["autonomous systems","robotics","controls","embedded software"]}}
{"source_id":"research_opportunities", "chunk_id":"communication_and_information_theory_research", "content":"Work in communications, coding and information theory focuses on high-reliability data transmission, network architectures, error-correcting codes and the software and firmware required to support these systems. This area involves engineering of software for distributed communications, cryptographic protocols and efficient code generation for constrained devices." , "metadata":{"topic":"communication_and_information_theory", "program":"software_engineering", "tags":["communications","coding theory","software systems"]}}
{"source_id":"research_opportunities", "chunk_id":"computer_architecture_and_cloud_computing_research", "content":"This focus area addresses software engineering aspects of computer architecture and cloud/distributed computing: designing scalable, resilient, low-latency software systems, virtualization, high-performance computing and software/hardware co-design for emerging platforms." , "metadata":{"topic":"computer_architecture_and_cloud_computing", "program":"software_engineering", "tags":["cloud computing","distributed systems","software architecture"]}}
{"source_id":"research_opportunities", "chunk_id":"data_analytics_and_machine_learning_research", "content":"Data analytics, informatics and machine learning research spans software engineering for large-scale data pipelines, AI/ML model development, deployment and lifecycle management, as well as software for interpreting, visualizing and operationalizing insights from big data." , "metadata":{"topic":"data_analytics_and_machine_learning", "program":"software_engineering", "tags":["machine learning","data analytics","software lifecycle"]}}
{"source_id":"research_opportunities", "chunk_id":"embedded_systems_research", "content":"Embedded systems research involves the development of software that controls hardware in constrained environments (low power, real-time, resource limited). It includes system-level software, firmware, real-time operating systems, IoT devices and integration with larger software ecosystems." , "metadata":{"topic":"embedded_systems", "program":"software_engineering", "tags":["embedded software","real-time systems","IoT"]}}
{"source_id":"research_opportunities", "chunk_id":"wireless_networking_and_system_security_research", "content":"This area focuses on wireless networking, security and systems software engineering: design of secure protocols for wireless/mobile systems, software to support resilient and pervasive connectivity, networked system architectures and the software implications of new wireless technologies." , "metadata":{"topic":"wireless_networking_and_system_security", "program":"software_engineering", "tags":["wireless networking","security","systems software"]}}
{"source_id":"research_opportunities", "chunk_id":"software_engineering_and_quality_assurance_research", "content":"Software engineering and quality assurance research covers methodologies for software lifecycle (requirements, design, testing, maintenance, DevOps), software metrics, reliability and verification & validation of large-scale systems, aligning with UA’s emphasis on preparing students for the full software production lifecycle. :contentReference[oaicite:1]{index=1}" , "metadata":{"topic":"software_engineering_and_quality_assurance", "program":"software_engineering", "tags":["software lifecycle","quality assurance","DevOps"]}}