{"source_id":"ua_se_program_overview","chunk_id":"overview_1","content":"The Bachelor of Science in Software Engineering at the University of Arizona integrates proven engineering principles with modern software development practices. The program emphasizes the complete software development lifecycle (SDLC), including Agile methodologies, automated testing, continuous integration, and DevSecOps. It prepares students to meet the growing demand for software engineers across commercial, industrial, and government sectors. Through agile and adaptive approaches, students develop skills for a rapidly evolving technology landscape.","metadata":{"topic":"program_overview","focus":"curriculum","level":"undergraduate"}}
{"source_id":"ua_se_program_overview","chunk_id":"overview_2","content":"The Software Engineering program trains students in relevant software methodologies, including Agile development, automated testing using continuous integration, and Software Development & Information Technology Operations (SW DevOps). These methodologies aim to enhance the speed and reliability of software application and service delivery, preparing graduates for diverse roles in the software engineering field.","metadata":{"topic":"program_overview","focus":"methodologies","keywords":["Agile","DevOps","continuous integration"]}}
{"source_id":"ua_se_program_overview","chunk_id":"learning_outcomes","content":"Graduates of the Software Engineering Bachelor of Science program will demonstrate the following learning outcomes: an ability to apply engineering design to produce solutions that meet specified needs considering public health, safety, and welfare, as well as global, cultural, social, environmental, and economic factors; an ability to communicate effectively with diverse audiences; an ability to recognize ethical and professional responsibilities in engineering contexts and make informed judgments; an ability to function effectively on teams that provide leadership and collaboration; an ability to develop and conduct appropriate experiments, analyze and interpret data, and use engineering judgment; and an ability to acquire and apply new knowledge as needed using appropriate learning strategies.","metadata":{"topic":"learning_outcomes","category":"program_goals"}}
{"source_id":"ua_se_program_overview","chunk_id":"program_details","content":"Program details: Coursework locations include Main Campus (Tucson), Arizona Online, and Yuma. Areas of interest include Computer & Information Science and Engineering & Technology. The program does not require a pre-major.","metadata":{"topic":"program_details","locations":["Tucson","Arizona Online","Yuma"],"areas_of_interest":["Computer & Information Science","Engineering & Technology"],"pre_major_required":false}}
{"source_id":"ua_se_program_overview","chunk_id":"math_requirement","content":"Mathematics requirement: The program expects substantial knowledge of calculus. Students begin with MATH 122A/B (Functions for Calculus and First-Semester Calculus) or MATH 125 (Calculus I). Those who complete this strand can advance to MATH 129 (Calculus II), MATH 223 (Vector Calculus), or higher. Students not yet ready for calculus must complete preparatory coursework.","metadata":{"topic":"requirements","subcategory":"mathematics","strand":"S-strand","level":"substantial"}}
{"source_id":"ua_se_program_overview","chunk_id":"language_requirement","content":"Second language requirement: None. A second language is not required for the Bachelor of Science in Software Engineering program at the University of Arizona.","metadata":{"topic":"requirements","subcategory":"second_language","required":false}}
